---
kind: method
id: M:Autodesk.Revit.DB.FilterOperatorAndTextString.Dispose
source: html/f2803f74-0c42-2ca6-7638-af694ddff88a.htm
---
# Autodesk.Revit.DB.FilterOperatorAndTextString.Dispose Method

Releases all resources used by the FilterOperatorAndTextString

## Syntax (C#)
```csharp
public void Dispose()
```